_posts/2021-10-11-boj-9093.html
---
title: BOJ 9093 단어 뒤집기
tags: STL
toc: true
toc_sticky: true
---

<div id="outline-container-org0687955" class="outline-2">
<h2 id="org0687955">BOJ 9093 단어 뒤집기</h2>
</div>

<div id="outline-container-orgc0f8bfd" class="outline-2">
<h2 id="orgc0f8bfd">접근하기</h2>
<div class="outline-text-2" id="text-orgc0f8bfd">
<ul class="org-ul">
<li>getline으로 한줄 입력받기</li>
<li>istringstream 이용 token으로 분리하기</li>
<li>std::reverse를 이용해서 string 뒤집기</li>
</ul>
</div>
</div>

<div id="outline-container-org69754ce" class="outline-2">
<h2 id="org69754ce">코드</h2>
<div class="outline-text-2" id="text-org69754ce">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;sstream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    cin &gt;&gt; N;
    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">split_char</span> = <span style="color: #ad7fa8; font-style: italic;">' '</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">line</span>;
        getline(cin &gt;&gt; ws, line);
        <span style="color: #8ae234; font-weight: bold;">istringstream</span> <span style="color: #ff6347;">split</span>(line);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">each</span>; getline(split, each, split_char);) {
            reverse(each.begin(), each.end());
            cout &lt;&lt; each &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>;
        }
        cout &lt;&lt; endl;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4c7660" class="outline-2">
<h2 id="orgc4c7660">문제 링크</h2>
<div class="outline-text-2" id="text-orgc4c7660">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/9093">https://www.acmicpc.net/problem/9093</a></li>
</ul>
</div>
</div>
